import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class page4 extends StatelessWidget {
  const page4({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(child: Scaffold(
      appBar: AppBar(),
      body: Center(
        child: Text("উপনিবেশবাদ বলতে একটি দেশ কর্তৃক অন্য একটি দেশের উপর রাজনৈতিক নিয়ন্ত্রণ নেয়াকে বোঝায় , যা প্রায়ই উপনিবেশ প্রতিষ্ঠার মাধ্যমে করা হয়ে থাকে। সাধারণত উপনিবেশ প্রতিষ্ঠার পেছনে উদ্দেশ্য থাকে অর্থনৈতিক আধিপত্য।উপনিবেশ শব্দটি এমন একটি সেট যা ঔপনিবেশিক শক্তি এবং উপনিবেশের মধ্যে অসম সম্পর্ক এবং প্রায়ই ঔপনিবেশিক এবং আদিবাসীদের মধ্যে অসম সম্পর্ক বর্ণনা করতে ব্যবহৃত হয়।১৭০০ এবং ১৮০০-এর দশকে, ইউরোপের ধনী, শক্তিশালী দেশ (যেমন ব্রিটেন, ফ্রান্স, স্পেন এবং নেদারল্যান্ডস) আফ্রিকা, দক্ষিণ আমেরিকা, এশিয়া এবং ক্যারিবিয়ানের মহাদেশের উপনিবেশ স্থাপন করে।এই ইউরোপীয় ঔপনিবেশিক সময় ছিল ষোড়শ শতাব্দী থেকে বিংশ শতাব্দীর মধ্যে যখন বিভিন্ন ইউরোপিয়ান ক্ষমতা দ্বারা এশিয়া, আফ্রিকা এবং আমেরিকা এর মধ্যে অনেকগুলো উপনিবেশ প্রতিষ্ঠিত হয়। অর্থনীতি ব্যয় প্রতিদ্বন্দ্বী অবকাঠামো প্রণয়ন জোরদার করার জন্য প্রথমে দেশগুলো একটি বাণিজ্যবাদ নীতি অনুসরণ করে,ফলে উপনিবেশগুলো শুধুমাত্র মাতৃ-দেশের সাথে বাণিজ্য করার জন্য অনুমোদিত ছিল। ঊনবিংশ শতাব্দীর মধ্যবর্তী  সময়ে শক্তিশালী ব্রিটিশ সাম্রাজ্য বাণিজ্যবাদ নীতি ও তার অন্তর্ভুক্ত সকল নিষেধাজ্ঞা অপসারণ ও চালু নীতির প্রণয়ন করেন, এবং এর পরিবর্তে মুক্ত বাণিজ্য প্রণয়ন করে।"),
      ),
    ));
  }
}
