import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class page1 extends StatelessWidget {
  const page1({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      appBar: AppBar(),
      body: Center(
        child: Text(
            "বাংলাদেশ দক্ষিণ এশিয়ার একটি জনবহুল ও উন্নয়নশীল রাষ্ট্র। ১৯৭১ সালের স্বাধীনতা যুদ্ধে পাকিস্তান থেকে স্বাধীনতা অর্জনের পর দেশটি বিশ্ব মানচিত্রে একটি স্বাধীন রাষ্ট্র হিসেবে আবির্ভূত হয়।বাংলাদেশের সভ্যতার ইতিহাস চার সহস্রাব্দেরও বেশি সময় ধরে সেই ক্যালকোলিথিক যুগ থেকে চলে আসছে। দেশটির প্রারম্ভিক ইতিহাস হচ্ছে আঞ্চলিক আধিপত্যের জন্য হিন্দু ও বৌদ্ধ সাম্রাজ্যসমূহের মধ্যকার দ্বন্দ্ব ও প্রতিযোগিতার ইতিহাস।ষষ্ঠ থেকে সপ্তম শতাব্দীতে এ অঞ্চলে ইসলামের আগমণ ঘটে। ত্রয়োদশ শতাব্দীর প্রারম্ভে বখতিয়ার খিলজীর নেতৃত্বে সামরিক বিজয়ের পাশাপাশি শাহ জালালের মতো সুন্নি দাঈদের নিরলস প্রচেষ্ঠায় ধীরে ধীরে ইসলাম এদেশে প্রভাবশালী ধর্ম হয়ে ওঠে। পরবর্তীতে মুসলিম শাসকরা মসজিদ নির্মাণ করে ইসলাম প্রচারে অবদান রাখেন। চতুর্দশ শতাব্দী থেকে এই অঞ্চল শাহী বাংলা হিসেবে সুলতান শামসুদ্দীন ইলিয়াস শাহ কর্তৃক শাসিত হয় যা দেশের অর্থনৈতিক সমৃদ্ধি ত্বরান্বিত করে এবং আঞ্চলিক সাম্রাজ্যগুলোর উপর সামরিক আধিপত্যের সূচনা করে। ইউরোপীয়রা সেসময় এই শাহী বাংলাকে বাণিজ্যের জন্য সবচেয়ে ধনী দেশ বলে উল্লেখ করেন।[১] পরবর্তীতে এই অঞ্চলটি মুঘল সাম্রাজ্যের অধীনে আসে এবং মুঘল সাম্রাজ্যের সবচেয়ে ধনী প্রদেশ হিসাবে পরিগণিত হয়। বাংলা সুবাহ গোটা মুঘল সাম্রাজ্যের জিডিপির প্রায় অর্ধেক এবং বিশ্ব জিডিপির ১২% উৎপাদন করে যা সমগ্র পশ্চিম ইউরোপের থেকেও বেশী ছিল।[২][৩][৪][৫] এই অর্থনৈতিক সমৃদ্ধি প্রাথমিক শিল্পায়ন যুগের সূচনা করে। এ সময় রাজধানী শহর ঢাকার জনসংখ্যা এক মিলিয়ন ছাড়িয়ে যায়।"),
      ),
    ));
  }
}
