import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class page5 extends StatelessWidget {
  const page5({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(child: Scaffold(
      appBar: AppBar(),
      body: Text("ইতিহাসবিদরা সাধারণত বিবেচনা করে প্রাথমিক যুগ বা শুরুর মধ্যযুগীয় সময়কাল, কখনও কখনও হিসাবে উল্লেখ করা হয় অন্ধকার বয়সের, 5 ম এর শেষ থেকে বা early ষ্ঠ শুরুর দিক থেকে স্থায়ী হিসাবে শতাব্দী দশম শতাব্দীতেএনসাইক্লোপিডিয়া তারা এর শুরু চিহ্নিত করেছে মধ্যবয়সী এর ইউরোপীয় ইতিহাস। বিকল্প শব্দ তারা এর শুরু চিহ্নিত করেছে মধ্যবয়সী এর ইউরোপীয় ইতিহাস। বিকল্প শব্দ েরী প্রাচীনত্ব এর সাথে ধারাবাহিকতার উপাদানগুলিকেএনসাইক্লোপিডিয়া  site:bn.wikiqube.net  জোর দেয় রোমান সাম্রাজ্যযদিও পিরিয়ডটি শেষ অবধি প্রবণতাগুলির ধারাবাহিকতা স্পষ্ট করে দেখেছে শাস্ত্রীয় প্রাচীনতাসহ জনসংখ্যা হ্রাসবিশেষত শহুরে কেন্দ্রগুলিতে বাণিজ্য হ্রাস, গ্লোবাল ওয়ার্মিংয়ের সামান্য বৃদ্ধি rise এবং স্থানান্তর বৃদ্ধি। উনিশ শতকে আদি মধ্যযুগকে প্রায়শই  নামে চিহ্নিত করা হত, এই সময়ের সাহিত্যিক এবং সাংস্কৃতিক আয়ের তুলনামূলক ঘাটতির উপর ভিত্তি করে একটি বৈশিষ্ট্য।[1] তবে পূর্ব রোমান সাম্রাজ্য, বা বাইজেন্টাইন সাম্রাজ্য, বাঁচতে অবিরত, যদিও 7 ম শতাব্দীতে রাশিদুন খিলাফত এবং উমাইয়া খিলাফত পূর্ববর্তী রোমান অঞ্চল স্বতন্ত্র জয় করে নিয়েছিল।এনসাইক্লোপিডিয়া ্রাথমিক মধ্যযুগ এর আগের বৈশিষ্ট্যের বৈশিষ্ট্যগুলিকে জোর দেওয়ার জন্য ব্যবহৃত হয় মধ্যযুগীয় পিরিয়ড যেমন ধারণাটি প্রয়াত পুরাকীর্তির সাথে ওভারল্যাপ হয়, নিম্নলিখিতগুলি অনুসরণ করে পতন এর পশ্চিম রোমান সাম্রাজ্য, এবং পূর্ববর্তী উচ্চ মধ্যযুগ (গ। 11 তম থেকে 13 তম শতাব্দী)।এনসাইক্লোপিডিয়া  "),
    ));
  }
}
